[
  {
    "title": "IPTVWeb Player",
    "description": "Stream IPTV subscriptions",
    "image": "/projectImages/iptvweb-screenshot-1.png",
    "image2": "/projectImages/iptvweb-screenshot-2.png",
    "image3": "",
    "body": "A cross-platform IPTV streaming SaaS solution built from the ground up, supporting Android, web, and TV platforms with a user base nearing 1,000. The frontend leverages React and Capacitor to provide seamless native API integration, while the .NET backend manages authentication, licensing, and API operations. PostgreSQL ensures efficient data and content management. Firebase is used for secure authentication, and RevenueCat handles subscription management. The backend and database are self-hosted on a VPS, featuring optimized security, automated backups, and high availability for a scalable and reliable streaming experience",
    "technologies": ["React", "Capacitor", ".NET", "HTML", "CSS", "PostgreSQL", "Firebase"],
    "github": "",
    "deployed": "https://iptvweb.app/#get-started",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "Wavelength",
    "description": "Mobile News Application",
    "image": "/projectImages/wavelength-2.png",
    "image2": "/projectImages/wavelength-3.png",
    "image3": "/projectImages/weather3.png",
    "technologies": ["React-Native", "Firebase", "Node.js", "HTML", "CSS", "AWS"],
    "body": "This mobile web application delivers a user-friendly, social media-style news platform designed to help a new generation access trustworthy, unbiased news directly from the source. It also offers a unique \"happy news\" feature, using sentiment analysis to surface uplifting content for users who want a more positive experience. Built with React Native, Firebase, Node.js, and AWS, the app offers seamless authentication, strong security, and an intuitive interface for browsing personalized news feeds. The platform was previously available on both Android and iOS devices.",
    "github": "",
    "deployed": "https://github.com/wavelength-digital-network",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  }
]
